// Задача №2
Console.Write("Напишите первое число: ");
int n1 = Convert.ToInt16(Console.ReadLine());
Console.Write("Напишите виорое число: ");
int n2 = Convert.ToInt16(Console.ReadLine());

if (n1 > n2) Console.Write("первое число больше!");
else Console.Write("Второе число больше!");