// Задача №006

// Запрашиваем число
Console.Write("Введите число: ");
int n = Convert.ToInt16(Console.ReadLine());

if (n % 2 == 0) Console.Write("Число является четным");
else Console.Write("Число является не четным");